Revit 2027 API
RebarContainerIterator.Current Property
Gets the item at the current position of the iterator.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual RebarContainerItem Current { get; }
Public Overridable ReadOnly Property Current As RebarContainerItem
	Get
public:
virtual property RebarContainerItem^ Current {
	RebarContainerItem^ get ();
}
abstract Current : RebarContainerItem with get
override Current : RebarContainerItem with get
Property Value
RebarContainerItem
Implements
IEnumerator<T>.Current
Exceptions
Exception | Condition
InvalidOperationException |  There is no current item in the iterator.
Remarks
There is no current item if the iterator has not started yet or has been done.
See Also
Reference
RebarContainerIterator Class
Autodesk.Revit.DB.Structure Namespace